Tekla Open API Reference for Tekla Structures 2025
WeldAttributes Constructor
Overload List
Name | Description
Weld.WeldAttributes()
 Creates a new default weld attributes instance that loads standard attributes.
Weld.WeldAttributes(String)
 Creates a new weld attributes instance that loads the specified attributes.
Top
See Also
Reference
Weld.WeldAttributes Class
Tekla.Structures.Drawing Namespace